#### SteelElementProperties Members

---

|  |
| --- |
| SteelElementProperties Class   Methods   Properties   See Also |

The  SteelElementProperties  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | AddFabricationInformationForRevitElements | This method adds fabrication information to the given elements. |
| Public method | Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from  APIObject  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method Static member | GetFabricationUniqueID | This method will return the fabrication id for the given reference. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method Static member | GetReference | This method will return the reference for the given fabrication id. |
| Public method Static member | GetSteelElementProperties | Get SteelElementProperties for the input element if they exist. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from  APIObject  .) |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | UniqueID | This method will return the fabrication id. This represents the link between the Revit and the Steel Core element. |

# See Also

SteelElementProperties Class

Autodesk.Revit.DB.Steel Namespace